## <span style="text-transform:uppercase">staging</span> Module: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  aws_vpc.main: Refreshing state... [id=vpc-0d895a01b47ccfb04]
aws_eip.lambda: Refreshing state... [id=eipalloc-06155a058c941b5dd]
aws_default_security_group.default: Refreshing state... [id=sg-07bbdcb4fc6d20a75]
aws_default_route_table.default: Refreshing state... [id=rtb-0228b7d35bdfba348]
aws_subnet.private: Refreshing state... [id=subnet-07f256fc1e9b65732]
aws_default_network_acl.default: Refreshing state... [id=acl-0a293e49ea86cc7ce]
aws_internet_gateway.gw: Refreshing state... [id=igw-08031402dc515616c]
aws_subnet.public: Refreshing state... [id=subnet-066a4cc52f615255c]
aws_security_group.lambda: Refreshing state... [id=sg-090d16d17a0b6c2b1]
aws_route_table.public: Refreshing state... [id=rtb-0c40a8fd1f51baec7]
aws_network_acl.main: Refreshing state... [id=acl-0af86631764523f8a]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-09d9428ba0886977f]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-1598225514]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-03329e92062edf232]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-09e7050aa7d123674]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05cc02536d86ce34d]
aws_route_table.private: Refreshing state... [id=rtb-08c76912dc727184b]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0043ca13d1dec5810]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-2802359572]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2068073685]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.efs will be created
  + resource "aws_security_group" "efs" {
      + arn                    = (known after apply)
      + description            = "Used by EFS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "metricsstaging_efs_sg"
        }
      + tags_all               = {
          + "Name" = "metricsstaging_efs_sg"
        }
      + vpc_id                 = "vpc-0d895a01b47ccfb04"
    }

  # aws_security_group_rule.efs_egress will be created
  + resource "aws_security_group_rule" "efs_egress" {
      + description              = "Allow lambda to egress to efs"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-090d16d17a0b6c2b1"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "egress"
    }

  # aws_security_group_rule.efs_ingress will be created
  + resource "aws_security_group_rule" "efs_ingress" {
      + description              = "Allow communication to EFS from the lambda sg"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-090d16d17a0b6c2b1"
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + efs_sg_id = (known after apply)

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"

Releasing state lock. This may take a few moments...
  ```
</details>